---
kind: type
id: T:Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition
source: html/2f710aa2-66b5-0995-1486-35482acd107e.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailDimensionTextPosition

Describes how the text will be positioned with respect to dimension line.

## Syntax (C#)
```csharp
public enum BendingDetailDimensionTextPosition
```